{
  "videoId": "Zy4cVtHJNvc",
  "title": "5 Error Handling Techniques for Production n8n Workflows",
  "channel": "Nate Herk | AI Automation",
  "fetchedAt": "2025-12-14T00:00:00Z",
  "status": "success",
  "fullText": "Here are five error handling techniques that you need to know if you want to build AI automations. So what an error workflow is is it's a separate workflow that starts with an error trigger. And the error trigger can link up to any of your active workflows. And the idea is that whenever an active workflow errors, it will just notify this workflow and then you can set up the logic of what do I want to happen with an error. Number two is the ability to have our workflows retry on failure. What this means is that whenever our node faces an error, it's just going to try again. And you can control like wait this much time and then try again, try again five times and then just move on, whatever you want. And the way you do that is within any node, so like an AI agent node, you're going to go up to your settings and you can see right here, you can turn on the switch that says retry on fail. So I'll turn that on and you can see it now opens up these two other things that say max tries, how many times you want it to retry, and then how long do you want it to wait between tries. So you have a couple levers here to pull. But let's move on to number three, which is having a fallback LLM. So if I check this on, it basically allows us to connect a different model in case the main one fails. So let's say open router is our favorite and we're using GPT 4.1 Mini. Open router's down or open AI is down. What we can do is we can connect another model over here and we can just go with Google Gemini. And now we have this model in place. So now if I save this workflow and I say hi, it's going to try that first model. It fails. And then what happens is it just goes to the fallback model. And now we make sure that we're still at least getting some sort of answer.",
  "topics": ["error handling", "error trigger", "retry on fail", "fallback LLM", "production workflows", "AI automations"]
}
